CREATE DATABASE UniversityTeachersDB COLLATE LATIN1_GENERAL_100_CI_AS_SC_UTF8;
GO
USE UniversityTeachersDB

CREATE TABLE WorkPlaces (
	id int IDENTITY(1, 1) PRIMARY KEY NOT NULL,
    placeName nvarchar(80) NOT NULL, 
	address nvarchar(100) NOT NULL,
)

CREATE TABLE Positions (
	Id int IDENTITY(1, 1) PRIMARY KEY NOT NULL,
	name nvarchar(60) NOT NULL,
    salaryPerHour INT NOT NULL,
)
GO

CREATE TABLE Disciplines (
	id int IDENTITY(1, 1) PRIMARY KEY NOT NULL,
	name nvarchar(80) NOT NULL,
)
GO

CREATE TABLE Streets (
    id int IDENTITY(1, 1) PRIMARY KEY NOT NULL,
    streetName nvarchar(50) NOT NULL,
)
GO

CREATE TABLE HomeAddresses (
    id int IDENTITY(1, 1) PRIMARY KEY NOT NULL,
    streetId INT NOT NULL FOREIGN KEY REFERENCES Streets(id) ON DELETE CASCADE,
    building nvarchar(8) NOT NULL,
    flatNum INT
)
GO

CREATE TABLE Teachers (
	id int IDENTITY(1, 1) PRIMARY KEY NOT NULL,
    surname nvarchar(50) NOT NULL,
    name nvarchar(30) NOT NULL,
    patronymic nvarchar(50) NOT NULL,
    phoneNum nvarchar(12) NOT NULL,
	homeAddressId INT NOT NULL FOREIGN KEY REFERENCES HomeAddresses(id) ON DELETE CASCADE,
    workPlaceId int NOT NULL FOREIGN KEY REFERENCES WorkPlaces(id) ON DELETE CASCADE,
	positionId int NOT NULL FOREIGN KEY REFERENCES Positions(id) ON DELETE CASCADE,
)
GO

CREATE TABLE TeachersDisciplines (
    teacherId int NOT NULL FOREIGN KEY REFERENCES Teachers(id) ON DELETE CASCADE,
	disciplineId int NOT NULL FOREIGN KEY REFERENCES Disciplines(id) ON DELETE CASCADE,
    numOfHours INT NOT NULL,
    CONSTRAINT PK_Teacher_Discipline PRIMARY KEY (teacherId, disciplineId),
)
GO

CREATE TABLE TeachersCharacteristics (
    teacherId INT NOT NULL primary key FOREIGN KEY REFERENCES Teachers(id) ON DELETE CASCADE,
    characteristic nvarchar(1500)
)
GO

INSERT INTO WorkPlaces VALUES 
    ('Кафедра алгебри та інформатики', 'вул. Університетська, 28, 1 поверх'), -- 1
    ('Кафедра математичного аналізу', 'вул. Університетська, 28, 2 поверх'), -- 2
    ('Кафедра прикладної математики та інформаційних технологій', 'вул. Університетська, 28, 3 поверх'), -- 3
    ('Кафедра історії та культури української мови', 'вул. Коцюбиинського 2, 6 корпус ЧНУ'), -- 4
    ('Кафедра теоретичної фізики та комп`ютерного моделювання', 'вул. Рівненська, 16, 9 корпус ЧНУ'), -- 5
    ('Кафедра комп`ютерних наук', 'вул. Рівненська, 16, 8 корпус ЧНУ'); -- 6
    
INSERT INTO Positions VALUES
    ('Асистент', 200), -- 1
    ('Доцент', 300), -- 2
    ('Професор', 400); -- 3
    
INSERT INTO Disciplines VALUES 
    ('Фізика'), -- 1
    ('Вища метематика'), -- 2
    ('Технології захисту інформації'), -- 3
    ('Українська мова(за проф спрямуванням)'), -- 4
    ('Прикладна математика'), -- 5
    ('Основи WEB-технологій'), -- 6
    ('Історія україни'), -- 7
    ('Математичні методи дослідження операцій'), -- 8
    ('Дискретна математика'), -- 9
    ('Теорія ймовірності'), -- 10
    ('Математична статистика'); -- 11
    
INSERT INTO Streets VALUES
    ('вул. Університетська'), -- 1
    ('вул. Головна'), -- 2
    ('вул. Проспект незалежності'), -- 3
    ('вул. Івана Богуна'), -- 4
    ('вул. Поштова'), -- 5
    ('вул. Богдана Хмельницького'), -- 6
    ('вул. Лесі Українки'), -- 7
    ('вул. Вірменська'); -- 8

INSERT INTO HomeAddresses VALUES 
    (1, '17-A', 5), -- 1
    (2, '103-А', 71), -- 2
    (3, '21-Г', 19), -- 3
    (1, '29', 12), -- 4
    (4, '5', NULL), -- 5
    (5, '33-Б', NULL), -- 6
    (6, '24', 3), -- 7
    (3, '108', 80), -- 8
    (7, '4-В', 16), -- 9
    (8, '9', NULL); -- 10
    
INSERT INTO Teachers VALUES
    ('Петренко', 'Іван', 'Валерійович', '380955236263', 1, 4, 3), -- 1
    ('Федирчик', 'Анатолій', 'Олексійович', '380505634745', 2, 1, 3), -- 2
    ('Волощук', 'Михайло', 'Степанович', '380952771289', 3, 2, 3), -- 3
    ('Кравченко', 'Анастасія', 'Володимирівна','380665646733', 4, 1, 2), -- 4
    ('Філіпчук', 'Валентин', 'Дмитрович', '380507984356', 5, 3, 2), -- 5
    ('Сокирчук', 'Павло', 'Валерійович', '380682759343', 6, 5, 2), -- 6
    ('Дмитрук', 'Ірина', 'Михайлівна', '380956787982', 7, 2, 2), -- 7
    ('Левченко', 'Назарій', 'Юрійович', '380953325467', 8, 2, 1), -- 8
    ('Остапченко', 'Олександр', 'Вікторович', '380508954678', 9, 1, 1), -- 9
    ('Михальчук', 'Йосиф', 'Сергійович', '380661203919', 10, 6, 1); -- 10
    
INSERT INTO TeachersDisciplines VALUES
    (1, 4, 60),
    (1, 7, 120),
    (2, 2, 50),
    (3, 2, 20),
    (3, 8, 90),
    (4, 9, 60),
    (5, 10, 80),
    (5, 9, 50),
    (6, 1, 120),
    (6, 2, 50),
    (6, 5, 80),
    (7, 2, 60),
    (8, 10, 120),
    (8, 11, 20),
    (9, 9, 60),
    (9, 6, 50),
    (9, 3, 30),
    (10, 3, 30),
    (10, 6, 60);
    
INSERT INTO TeachersCharacteristics VALUES
    (1, 'Професор кафедри історії та культури української мови. Доктор філологічних наук. \n Наукова біографія: СКАБ Мар’ян Стефанович народився 20 травня 1958 року в Чернівцях. Навчався в Чернівецькій середній школі № 23 (1965–1975) та Чернівецькому державному університеті (1975–1980). Упродовж 1980–89 років він працював у Полтавському педагогічному інституті ім. В. Г. Короленка (асистент, з 1984 – старший викладач кафедри української мови; з 1986 – старший викладач, доцент кафедри загального та російського мовознавства; з 1989 – доцент кафедри української мови). У 1983–1987 роках М. С. Скаб заочно навчався в аспірантурі при Інституті мовознавства Академії наук України імені О. О. Потебні і 1988 року захистив кандидатську дисертацію під назвою „Семантично граматична структура українського вокатива” (науковий керівник – І. Р. Вихованець).'),
    (2, 'Професор, доктор фіз.-мат. наук, Професор кафедри алгебри та інформатики. \nГородецький В.В. народився у 1958 р. У 1979 році закінчив з відзнакою Чернівецький державний університет за спеціальністю «Математика» (кваліфікація "Математик. Викладач"). У 1985 році захистив кандидатську дисертацію „Про локалізацію та стабілізацію розв’язків задачі Коші для диференціальних рівнянь у класах узагальнених функцій” за спеціальністю 01.01.01 – математичний аналіз (науковий керівник – член-кореспондент НАН України Горбачук М.Л.), а у 1995 році – докторську дисертацію „Множини початкових значень гладких розв’язків диференціально-операторних рівнянь параболічного типу” за спеціальністю 01.01.02 – диференціальні рівняння у Львівському університеті імені Івана Франка. Професор – з 1997 року. З 1996 по 2019 рр. очолював кафедру алгебри та геометрії, яку в 2004 році перейменовано на кафедру алгебри та інформатики.'),
    (3, 'Завідувач кафедри, доктор фізико-математичних наук, професор. \n Закінчив Чернівецький державний університет в 1989 р. за спеціальністю "Прикладна математика" та здобув кваліфікацію "Математик". У 1989-1996 та 2001-2004 роках працював на кафедрі математичних проблем управління і кібернетики (МПУіК). Кандидатську дисертацію на тему “Управління і комп’ютерне моделювання дискретних систем з розгалуженням структур” за спеціальністю 01.05.02 – математичне моделювання та обчислювальні методи в наукових дослідженнях захистив у 1996 році. Напрям наукових досліджень – динамічні дискретні системи з розгалуженням структур, для яких розглядаються питання керованості, спостережності мінімаксного керування та комп’ютерного моделювання.'),
    (4, 'Доцент, кандидат педагогічних наук. Закінчила Чернівецький національний університет імені Юрія Федьковича у 2004 р. за спеціальністю "Математика" (кваліфікація "Математик. Викладач") та Київський торговельно-економічний інститут Київського національного торговельно-економічного університету у 2011 р. за спеціальністю "Фінанси". Кандидатську дисертацію за темою «Комп`ютерно орієнтовна методична система навчання інформатики майбутніх економістів у вищих навчальних закладах» (спеціальність 13.00.02 - "Теорія та методика навчання (інформатика)") захистила в 2016 р. Вчене звання доцента кафедри комп`ютерних наук ЧНУ присвоєне в 2022 році.'),
    (5, 'Доцент кафедри прикладної математики та інформаційних технологій. \n У 2001 році закінчив Чернівецький національний університет імені Юрія Федьковича і одержав диплом магістра математики (кваліфікація "Математик. Викладач"). У 2009 році захистив кандидатську дисертацію. У 2012 році отримав вчене звання доцента кафедри прикладної математики та інформаційних технологій.'),
    (6, 'Доцент кафедри теоретичної фізики та комп`ютерного моделювання. \n У 1993 році закінчив математичний факультет (кафедра математичних проблем управління та кібернетики, спеціальність – прикладна математика) Чернiвецького державного унiверситету (ЧДУ) із червоним дипломом і у 1995 році - аспiрантуру при цьому унiверситетi (кафедра математичного моделювання, науковий керiвник – доктор фiз.-мат. наук, професор Ясинський В.К.).'),
    (7, 'Доцент кафедри математичного аналізу. \n У 1994-1999 роках навчалася на кафедрі математичного моделювання математичного факультету Чернівецького національного університету. Закінчила університет у 1999 році за спеціальністю «Математика». У 2000-2003 роках навчалася в аспірантурі при кафедрі математичного моделювання під керівництвом проф., доктора фіз.-мат.наук  Івасишена С.Д.'),
    (8, 'Асистент кафедри математичного аналізу. \n Закінчив кафедру прикладної математики у 2012 році (диплом магістра з відзнакою). Асистент і аспірант кафедри математичного моделювання. Напрям наукового дослідження: «Розв’язування лінійних крайових задач із запізненням методом сплайн-апроксимацій». У грудні 2018 року захистив кандидатську дисертацію на тему "Апроксимація розв`язків крайових задач для диференціально-різницевих рівнянь зі змінним запізненням".'),
    (9, 'Асистент, кандидат фіз.-мат. наук. \n Закінчила Чернівецький національний університет ім. Ю.Федьковича в 2003 р. за спеціальність "Математика", здобула кваліфікацію "Математик. Викладач". Кандидатська дисертація на тему "Задача Коші для еволюційних рівнів з оператором узагальненого диференціювання та псевдо-Бесселевих операторів нескінченного порядку" (спеціальність 01.01.02 - диференціальне рівняння) захищена у 2009 р.'),
    (10, 'Асистент кафедри комп`ютерних наук. \n У 2003 році поступив на математичний факультет Чернівецького національного університету імені Юрія Федьковича. В 2008 році вступив на навчання до аспірантури Інситуту кібернетики НАН України. Під час навчання в аспірантурі працював над проблемою розпізнавання елементів дактильно-жестової мови. 23 грудня 2015 року захистив кандидатську дисертацію "Методи визначення ефективних ознак для розпізнавання елементів дактильно-жестової мови" на здобуття наукового ступеня кандидата технічних наук за спеціальністю 05.13.06 - Інформаційні технології.');